Repository: kitknox/rootshell
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, ca, cs, da, de, es, fi, fr, he, hu, it, ja, ko, nb, nl, pl, pt_br, pt_pt, ro, sl, sv, uk, vi, zh_hans, zh_hant

source: Generate Key
ar: إنشاء مفتاح
ca: Generar clau
cs: Vygenerovat klíč
da: Generer nøgle
de: Schlüssel generieren
es: Generar clave
fi: Luo avain
fr: Générer une clé
he: צור מפתח
hu: Kulcs generálása
it: Genera chiave
ja: キーを生成
ko: 키 생성
nb: Generer nøkkel
nl: Sleutel genereren
pl: Generuj klucz
pt_br: Gerar Chave
pt_pt: Gerar Chave
ro: Generează cheie
sl: Generiraj ključ
sv: Generera nyckel
uk: Згенерувати ключ
vi: Tạo khóa
zh_hans: 生成密钥
zh_hant: 產生金鑰

source: Generate New Key
ar: إنشاء مفتاح جديد
ca: Generar clau nova
cs: Vygenerovat nový klíč
da: Generer ny nøgle
de: Neuen Schlüssel generieren
es: Generar nueva clave
fi: Luo uusi avain
fr: Générer une nouvelle clé
he: צור מפתח חדש
hu: Új kulcs generálása
it: Genera nuova chiave
ja: 新しいキーを生成
ko: 새 키 생성
nb: Generer ny nøkkel
nl: Nieuwe sleutel genereren
pl: Generuj nowy klucz
pt_br: Gerar Nova Chave
pt_pt: Gerar Nova Chave
ro: Generează cheie nouă
sl: Generiraj nov ključ
sv: Generera ny nyckel
uk: Згенерувати новий ключ
vi: Tạo khóa mới
zh_hans: 生成新密钥
zh_hant: 產生新金鑰

source: Generate or import an SSH key to use for authentication
ar: أنشئ أو استورد مفتاح SSH لاستخدامه في المصادقة
ca: Genereu o importeu una clau SSH per utilitzar-la per a l'autenticació
cs: Vygenerujte nebo importujte SSH klíč pro ověřování
da: Generer eller importer en SSH-nøgle til godkendelse
de: Generieren oder importieren Sie einen SSH-Schlüssel zur Authentifizierung
es: Genere o importe una clave SSH para usar en la autenticación
fi: Luo tai tuo SSH-avain todennusta varten
fr: Générez ou importez une clé SSH à utiliser pour l'authentification
he: צור או ייבא מפתח SSH לשימוש באימות
hu: Generáljon vagy importáljon egy SSH kulcsot a hitelesítéshez
it: Genera o importa una chiave SSH da utilizzare per l'autenticazione
ja: 認証に使用するSSHキーを生成またはインポート
ko: 인증에 사용할 SSH 키를 생성하거나 가져오세요
nb: Generer eller importer en SSH-nøkkel for autentisering
nl: Genereer of importeer een SSH-sleutel voor authenticatie
pl: Wygeneruj lub zaimportuj klucz SSH do uwierzytelniania
pt_br: Gere ou importe uma chave SSH para usar na autenticação
pt_pt: Gere ou importe uma chave SSH para usar na autenticação
ro: Generează sau importă o cheie SSH pentru autentificare
sl: Generirajte ali uvozite ključ SSH za uporabo pri preverjanju pristnosti
sv: Generera eller importera en SSH-nyckel att använda för autentisering
uk: Згенеруйте або імпортуйте SSH-ключ для автентифікації
vi: Tạo hoặc nhập khóa SSH để dùng cho xác thực
zh_hans: 生成或导入 SSH 密钥以用于认证
zh_hant: 產生或匯入 SSH 金鑰以用於認證

source: Generate Palette
ar: توليد لوحة الألوان
ca: Genera la paleta
cs: Vygenerovat paletu
da: Generér palette
de: Palette generieren
es: Generar paleta
fi: Luo paletti
fr: Generer la palette
he: צור לוח צבעים
hu: Paletta letrehozasa
it: Genera tavolozza
ja: パレットを生成
ko: 팔레트 생성
nb: Generer palett
nl: Palet genereren
pl: Generuj palete
pt_br: Gerar paleta
pt_pt: Gerar paleta
ro: Genereaza paleta
sl: Ustvari paleto
sv: Generera palett
uk: Створити палітру
vi: Tạo bảng màu
zh_hans: 生成调色板
zh_hant: 產生調色盤

source: Generate PIV Key
ar: إنشاء مفتاح PIV
ca: Generar clau PIV
cs: Vygenerovat PIV klíč
da: Generer PIV-nøgle
de: PIV-Schlüssel generieren
es: Generar clave PIV
fi: Luo PIV-avain
fr: Générer une clé PIV
he: צור מפתח PIV
hu: PIV kulcs generálása
it: Genera chiave PIV
ja: PIVキーを生成
ko: PIV 키 생성
nb: Generer PIV-nøkkel
nl: PIV-sleutel genereren
pl: Generuj klucz PIV
pt_br: Gerar Chave PIV
pt_pt: Gerar Chave PIV
ro: Generează cheie PIV
sl: Generiraj ključ PIV
sv: Generera PIV-nyckel
uk: Згенерувати PIV-ключ
vi: Tạo khóa PIV
zh_hans: 生成 PIV 密钥
zh_hant: 產生 PIV 金鑰

source: Generate SSH Key
ar: إنشاء مفتاح SSH
ca: Generar clau SSH
cs: Vygenerovat SSH klíč
da: Generer SSH-nøgle
de: SSH-Schlüssel generieren
es: Generar clave SSH
fi: Luo SSH-avain
fr: Générer une clé SSH
he: צור מפתח SSH
hu: SSH kulcs generálása
it: Genera chiave SSH
ja: SSHキーを生成
ko: SSH 키 생성
nb: Generer SSH-nøkkel
nl: SSH-sleutel genereren
pl: Generuj klucz SSH
pt_br: Gerar Chave SSH
pt_pt: Gerar Chave SSH
ro: Generează cheie SSH
sl: Generiraj ključ SSH
sv: Generera SSH-nyckel
uk: Згенерувати SSH-ключ
vi: Tạo khóa SSH
zh_hans: 生成 SSH 密钥
zh_hant: 產生 SSH 金鑰

source: Generate Token
ar: إنشاء رمز
ca: Generar token
cs: Vygenerovat token
da: Generer token
de: Token generieren
es: Generar token
fi: Luo tunniste
fr: Générer un jeton
he: צור אסימון
hu: Token generálása
it: Genera token
ja: トークンを生成
ko: 토큰 생성
nb: Generer token
nl: Token genereren
pl: Generuj token
pt_br: Gerar Token
pt_pt: Gerar Token
ro: Generează jeton
sl: Generiraj žeton
sv: Generera token
uk: Згенерувати токен
vi: Tạo token
zh_hans: 生成令牌
zh_hant: 產生權杖

source: Generate YubiKey Key
ar: إنشاء مفتاح YubiKey
ca: Generar clau YubiKey
cs: Vygenerovat klíč YubiKey
da: Generer YubiKey-nøgle
de: YubiKey-Schlüssel generieren
es: Generar clave YubiKey
fi: Luo YubiKey-avain
fr: Générer une clé YubiKey
he: צור מפתח YubiKey
hu: YubiKey kulcs generálása
it: Genera chiave YubiKey
ja: YubiKeyキーを生成
ko: YubiKey 키 생성
nb: Generer YubiKey-nøkkel
nl: YubiKey-sleutel genereren
pl: Generuj klucz YubiKey
pt_br: Gerar Chave YubiKey
pt_pt: Gerar Chave YubiKey
ro: Generează cheie YubiKey
sl: Generiraj ključ YubiKey
sv: Generera YubiKey-nyckel
uk: Згенерувати ключ YubiKey
vi: Tạo khóa YubiKey
zh_hans: 生成 YubiKey 密钥
zh_hant: 產生 YubiKey 金鑰

source: Generated from your theme's base colors.
ar: مولّدة من الألوان الأساسية لنسقك.
ca: Generada a partir dels colors base del vostre tema.
cs: Vygenerováno ze základních barev vašeho motivu.
da: Genereret fra dit temas grundfarver.
de: Generiert aus den Grundfarben Ihres Designs.
es: Generada a partir de los colores base de tu tema.
fi: Luotu teemasi perusvarien pohjalta.
fr: Generee a partir des couleurs de base de votre theme.
he: נוצר מצבעי הבסיס של ערכת הנושא שלך.
hu: A temad alapszineibol generalva.
it: Generata dai colori base del tuo tema.
ja: テーマの基本色から生成されます。
ko: 테마의 기본 색상에서 생성됩니다.
nb: Generert fra temaets grunnfarger.
nl: Gegenereerd uit de basiskleuren van je thema.
pl: Wygenerowana z kolorow bazowych motywu.
pt_br: Gerada a partir das cores base do seu tema.
pt_pt: Gerada a partir das cores base do seu tema.
ro: Generata din culorile de baza ale temei.
sl: Ustvarjeno iz osnovnih barv vase teme.
sv: Genererad från ditt temas basfärger.
uk: Створено на основі базових кольорів вашої теми.
vi: Được tạo từ các màu cơ bản của chủ đề.
zh_hans: 根据主题的基础颜色生成。
zh_hant: 根據佈景主題的基礎顏色產生。

source: Generates an ASCII-armored public-key block (with a self-signature) that the remote imports with `gpg --import`. Triggers the key's normal auth prompt.
ar: يُنشئ كتلة مفتاح عام بترميز ASCII (مع توقيع ذاتي) يستوردها الجهاز البعيد بـ `gpg --import`. يُفعّل مطالبة المصادقة المعتادة للمفتاح.
ca: Genera un bloc de clau pública en ASCII (amb una autosignatura) que el remot importa amb `gpg --import`. Activa la sol·licitud d'autenticació habitual de la clau.
cs: Vygeneruje blok veřejného klíče v ASCII formátu (s vlastním podpisem), který vzdálený stroj naimportuje pomocí `gpg --import`. Vyvolá běžnou výzvu k ověření klíče.
da: Genererer en ASCII-armoreret blok med en offentlig nøgle (med en selvsignatur), som fjernsystemet importerer med `gpg --import`. Udløser nøglens normale autentificeringsprompt.
de: Erzeugt einen ASCII-armored Block des öffentlichen Schlüssels (mit Selbstsignatur), den die Gegenstelle per `gpg --import` importiert. Löst die übliche Authentifizierungsabfrage des Schlüssels aus.
es: Genera un bloque de clave pública en formato ASCII-armored (con una autofirma) que el remoto importa con `gpg --import`. Activa la solicitud de autenticación normal de la clave.
fi: Luo ASCII-armored julkisen avaimen lohkon (jossa on itse-allekirjoitus), jonka etäkone tuo komennolla `gpg --import`. Käynnistää avaimen tavanomaisen todennuskehotteen.
fr: Génère un bloc de clé publique en ASCII-armored (avec une auto-signature) que la machine distante importe avec `gpg --import`. Déclenche l'invite d'authentification normale de la clé.
he: מייצר בלוק מפתח ציבורי מקודד ASCII-armored (עם חתימה עצמית) שהמארח המרוחק מייבא באמצעות `gpg --import`. מפעיל את בקשת האימות הרגילה של המפתח.
hu: Generál egy ASCII-armored nyilvános kulcs blokkot (önaláírással), amelyet a távoli gép `gpg --import` paranccsal importál. Aktiválja a kulcs szokásos hitelesítési kérését.
it: Genera un blocco di chiave pubblica in formato ASCII-armored (con autofirma) che il remoto importa con `gpg --import`. Attiva il normale prompt di autenticazione della chiave.
ja: リモートが`gpg --import`でインポートするASCII-armored形式の公開鍵ブロック(自己署名付き)を生成します。キーの通常の認証プロンプトが表示されます。
ko: 원격이 `gpg --import`로 가져오는 ASCII-armored 공개 키 블록(자체 서명 포함)을 생성합니다. 키의 일반적인 인증 프롬프트가 트리거됩니다.
nb: Genererer en ASCII-armored offentlig nøkkelblokk (med selvsignatur) som fjernverten importerer med `gpg --import`. Utløser nøkkelens vanlige autentiseringsforespørsel.
nl: Genereert een ASCII-armored publieke sleutelblok (met zelf-ondertekening) dat de externe host importeert met `gpg --import`. Activeert de normale authenticatieprompt van de sleutel.
pl: Generuje blok klucza publicznego w formacie ASCII-armored (z autopodpisem), który zdalny host importuje poleceniem `gpg --import`. Wywołuje standardowe okno uwierzytelniania dla tego klucza.
pt_br: Gera um bloco de chave pública em ASCII-armored (com uma autoassinatura) que o remoto importa com `gpg --import`. Aciona o prompt de autenticação normal da chave.
pt_pt: Gera um bloco de chave pública em ASCII-armored (com uma auto-assinatura) que o remoto importa com `gpg --import`. Acciona o pedido de autenticação normal da chave.
ro: Generează un bloc de cheie publică în ASCII-armored (cu o auto-semnătură) pe care sistemul la distanță îl importă cu `gpg --import`. Declanșează solicitarea normală de autentificare a cheii.
sl: Ustvari blok javnega ključa v formatu ASCII-armored (s samopodpisom), ki ga oddaljeni gostitelj uvozi z `gpg --import`. Sproži običajni poziv za overjanje ključa.
sv: Genererar ett ASCII-armored publikt nyckelblock (med en självsignatur) som fjärren importerar med `gpg --import`. Utlöser nyckelns vanliga autentiseringsfråga.
uk: Генерує ASCII-armored блок відкритого ключа (з самопідписом), який віддалена сторона імпортує за допомогою `gpg --import`. Викликає звичайний запит автентифікації ключа.
vi: Tạo một khối khóa công khai dạng ASCII-armored (kèm chữ ký tự ký) để máy từ xa nhập bằng `gpg --import`. Sẽ kích hoạt lời nhắc xác thực thông thường của khóa.
zh_hans: 生成一个 ASCII-armored 公钥块（含自签名），供远程通过 `gpg --import` 导入。会触发该密钥的常规认证提示。
zh_hant: 產生一個 ASCII-armored 公鑰區塊（含自我簽章），供遠端透過 `gpg --import` 匯入。會觸發該金鑰的一般驗證提示。

source: Generates the extended 256-color palette from your theme's base 16 colors using perceptually uniform interpolation in CIELAB color space.
ar: يولّد لوحة الألوان الموسّعة ذات 256 لونًا من الألوان الأساسية الـ 16 لنسقك باستخدام الاستيفاء الإدراكي المنتظم في فضاء ألوان CIELAB.
ca: Genera la paleta estesa de 256 colors a partir dels 16 colors base del vostre tema mitjançant interpolació perceptualment uniforme a l'espai de color CIELAB.
cs: Vygeneruje rozšířenou 256barevnou paletu ze základních 16 barev vašeho motivu pomocí perceptuálně uniformní interpolace v barevném prostoru CIELAB.
da: Genererer den udvidede 256-farvepalette fra dit temas 16 grundfarver ved brug af perceptuelt ensartet interpolation i CIELAB-farverummet.
de: Generiert die erweiterte 256-Farben-Palette aus den 16 Grundfarben Ihres Designs mittels wahrnehmungsgleichmäßiger Interpolation im CIELAB-Farbraum.
es: Genera la paleta extendida de 256 colores a partir de los 16 colores base de tu tema mediante interpolacion perceptualmente uniforme en el espacio de color CIELAB.
fi: Luo laajennetun 256 varin paletin teemasi 16 perusvarista kayttaen havainnoinnillisesti tasaista interpolointia CIELAB-variavaruudessa.
fr: Genere la palette etendue de 256 couleurs a partir des 16 couleurs de base de votre theme en utilisant une interpolation perceptuellement uniforme dans l'espace colorimetrique CIELAB.
he: יוצר את לוח הצבעים המורחב של 256 צבעים מ-16 צבעי הבסיס של ערכת הנושא שלך באמצעות אינטרפולציה אחידה תפיסתית במרחב הצבעים CIELAB.
hu: A kiterjesztett 256 szines palettat a temad 16 alapszinebol generalja perceptualisan egyszeges interpolacioval a CIELAB szinterben.
it: Genera la tavolozza estesa a 256 colori dai 16 colori base del tema utilizzando un'interpolazione percettivamente uniforme nello spazio colore CIELAB.
ja: テーマの基本16色から、CIELAB 色空間での知覚的に均一な補間を使用して、拡張256色パレットを生成します。
ko: CIELAB 색 공간에서 지각적으로 균일한 보간법을 사용하여 테마의 기본 16색에서 확장 256색 팔레트를 생성합니다.
nb: Genererer den utvidede 256-fargepaletten fra temaets 16 grunnfarger ved hjelp av perseptuelt uniform interpolasjon i CIELAB-fargerommet.
nl: Genereert het uitgebreide 256-kleurenpalet uit de 16 basiskleuren van je thema met perceptueel uniforme interpolatie in de CIELAB-kleurruimte.
pl: Generuje rozszerzona palete 256 kolorow z 16 kolorow bazowych motywu, uzywajac percepcyjnie rownomiernej interpolacji w przestrzeni kolorow CIELAB.
pt_br: Gera a paleta estendida de 256 cores a partir das 16 cores base do seu tema usando interpolacao perceptualmente uniforme no espaco de cores CIELAB.
pt_pt: Gera a paleta alargada de 256 cores a partir das 16 cores base do seu tema utilizando interpolacao percetualmente uniforme no espaco de cores CIELAB.
ro: Genereaza paleta extinsa de 256 de culori din cele 16 culori de baza ale temei, folosind interpolare perceptual uniforma in spatiul de culori CIELAB.
sl: Ustvari razsirjeno paleto 256 barv iz 16 osnovnih barv vase teme z uporabo zaznano enakomerne interpolacije v barvnem prostoru CIELAB.
sv: Genererar den utökade 256-färgspaletten från ditt temas 16 basfärger med perceptuellt enhetlig interpolation i CIELAB-färgrymden.
uk: Створює розширену 256-кольорову палітру з 16 базових кольорів вашої теми за допомогою перцептивно рівномірної інтерполяції у колірному просторі CIELAB.
vi: Tạo bảng màu mở rộng 256 màu từ 16 màu cơ bản của chủ đề bằng nội suy đồng đều tri giác trong không gian màu CIELAB.
zh_hans: 使用 CIELAB 色彩空间中的感知均匀插值，从主题的 16 种基础颜色生成扩展的 256 色调色板。
zh_hant: 使用 CIELAB 色彩空間中的感知均勻內插法，從佈景主題的 16 種基礎顏色產生擴充的 256 色調色盤。

source: Generating an RSA key on-device can take several seconds (especially at 4096 bits). Keep this screen open until it finishes.
ar: قد يستغرق توليد مفتاح RSA على الجهاز عدة ثوانٍ (خاصة بحجم 4096 بت). أبقِ هذه الشاشة مفتوحة حتى ينتهي.
ca: Generar una clau RSA al dispositiu pot trigar uns segons (especialment a 4096 bits). Mantén aquesta pantalla oberta fins que finalitzi.
cs: Vygenerování klíče RSA v zařízení může trvat několik sekund (zejména při 4096 bitech). Ponechte tuto obrazovku otevřenou, dokud nedokončí.
da: Generering af en RSA-nøgle på enheden kan tage flere sekunder (især ved 4096 bit). Lad denne skærm være åben, indtil den er færdig.
de: Das Erzeugen eines RSA-Schlüssels auf dem Gerät kann mehrere Sekunden dauern (besonders bei 4096 Bit). Lassen Sie diesen Bildschirm geöffnet, bis es abgeschlossen ist.
es: Generar una clave RSA en el dispositivo puede tardar varios segundos (especialmente con 4096 bits). Mantén esta pantalla abierta hasta que termine.
fi: RSA-avaimen luominen laitteessa voi kestää useita sekunteja (etenkin 4096-bittisenä). Pidä tämä näyttö auki, kunnes se on valmis.
fr: La génération d'une clé RSA sur l'appareil peut prendre plusieurs secondes (surtout en 4096 bits). Laissez cet écran ouvert jusqu'à la fin.
he: יצירת מפתח RSA במכשיר עשויה להימשך מספר שניות (במיוחד ב-4096 ביט). השאר מסך זה פתוח עד לסיום.
hu: Az RSA-kulcs eszközön történő generálása több másodpercig tarthat (különösen 4096 biten). Tartsa nyitva ezt a képernyőt, amíg be nem fejeződik.
it: La generazione di una chiave RSA sul dispositivo può richiedere diversi secondi (specialmente a 4096 bit). Lascia aperta questa schermata fino al termine.
ja: デバイス上でのRSA鍵の生成には数秒かかることがあります(特に4096ビット)。完了するまでこの画面を開いたままにしてください。
ko: 기기에서 RSA 키를 생성하는 데 몇 초가 걸릴 수 있습니다(특히 4096비트). 완료될 때까지 이 화면을 열어 두세요.
nb: Generering av en RSA-nøkkel på enheten kan ta flere sekunder (særlig ved 4096 bit). Hold denne skjermen åpen til den er ferdig.
nl: Het genereren van een RSA-sleutel op het apparaat kan enkele seconden duren (vooral bij 4096 bits). Houd dit scherm open totdat het klaar is.
pl: Generowanie klucza RSA na urządzeniu może zająć kilka sekund (zwłaszcza przy 4096 bitach). Pozostaw ten ekran otwarty, aż zakończy.
pt_br: Gerar uma chave RSA no dispositivo pode levar alguns segundos (especialmente com 4096 bits). Mantenha esta tela aberta até concluir.
pt_pt: Gerar uma chave RSA no dispositivo pode demorar alguns segundos (especialmente com 4096 bits). Mantenha este ecrã aberto até terminar.
ro: Generarea unei chei RSA pe dispozitiv poate dura câteva secunde (în special la 4096 de biți). Țineți acest ecran deschis până se termină.
sl: Ustvarjanje ključa RSA v napravi lahko traja nekaj sekund (zlasti pri 4096 bitih). Ohranite ta zaslon odprt, dokler se ne zaključi.
sv: Att generera en RSA-nyckel på enheten kan ta flera sekunder (särskilt vid 4096 bitar). Håll denna skärm öppen tills den är klar.
uk: Генерація ключа RSA на пристрої може зайняти кілька секунд (особливо за 4096 біт). Тримайте цей екран відкритим до завершення.
vi: Việc tạo khóa RSA trên thiết bị có thể mất vài giây (đặc biệt ở 4096 bit). Giữ màn hình này mở cho đến khi hoàn tất.
zh_hans: 在设备上生成 RSA 密钥可能需要几秒钟(尤其是 4096 位)。完成前请保持此屏幕打开。
zh_hant: 在裝置上生成 RSA 金鑰可能需要幾秒鐘(尤其是 4096 位元)。完成前請保持此畫面開啟。

source: Generating key on YubiKey...
ar: جارٍ إنشاء المفتاح على YubiKey...
ca: Generant la clau al YubiKey...
cs: Generování klíče na YubiKey…
da: Genererer nøgle på YubiKey...
de: Schlüssel wird auf dem YubiKey generiert …
es: Generando clave en YubiKey…
fi: Luodaan avainta YubiKeylle...
fr: Génération de la clé sur le YubiKey…
he: יוצר מפתח ב-YubiKey...
hu: Kulcs generálása a YubiKey-en...
it: Generazione chiave su YubiKey...
ja: YubiKeyでキーを生成中...
ko: YubiKey에서 키 생성 중...
nb: Genererer nøkkel på YubiKey …
nl: Sleutel genereren op YubiKey...
pl: Generowanie klucza na YubiKey...
pt_br: Gerando chave no YubiKey...
pt_pt: A gerar chave no YubiKey...
ro: Se generează cheia pe YubiKey...
sl: Generiranje ključa na YubiKey ...
sv: Genererar nyckel på YubiKey...
uk: Генерація ключа на YubiKey…
vi: Đang tạo khóa trên YubiKey...
zh_hans: 正在 YubiKey 上生成密钥…
zh_hant: 正在 YubiKey 上產生金鑰⋯

source: Generating SSH key...
ar: جارٍ إنشاء مفتاح SSH...
ca: Generant la clau SSH...
cs: Generování SSH klíče...
da: Genererer SSH-nøgle...
de: SSH-Schlüssel wird generiert...
es: Generando clave SSH...
fi: Luodaan SSH-avainta...
fr: Génération de la clé SSH...
he: יוצר מפתח SSH...
hu: SSH kulcs generálása...
it: Generazione della chiave SSH in corso...
ja: SSH鍵を生成中...
ko: SSH 키 생성 중...
nb: Genererer SSH-nøkkel...
nl: SSH-sleutel genereren...
pl: Generowanie klucza SSH...
pt_br: Gerando chave SSH...
pt_pt: A gerar chave SSH...
ro: Se generează cheia SSH...
sl: Ustvarjanje SSH-ključa ...
sv: Genererar SSH-nyckel...
uk: Генерація SSH-ключа...
vi: Đang tạo khóa SSH...
zh_hans: 正在生成 SSH 密钥...
zh_hant: 正在產生 SSH 金鑰⋯

source: Generating the public key produces a self-signature, so the same authentication you use for signing with this key will be required (Face ID, passcode, or YubiKey tap/PIN).
ar: إنشاء المفتاح العام يُنتج توقيعاً ذاتياً، لذا ستُطلب نفس المصادقة التي تستخدمها للتوقيع بهذا المفتاح (Face ID أو رمز الدخول أو لمسة/PIN لـ YubiKey).
ca: Generar la clau pública produeix una autosignatura, així que es requerirà la mateixa autenticació que utilitzeu per signar amb aquesta clau (Face ID, codi d'accés o toc/PIN de YubiKey).
cs: Generování veřejného klíče vytváří vlastní podpis, takže bude vyžadováno stejné ověření, jaké používáte k podepisování tímto klíčem (Face ID, kód, nebo dotyk/PIN YubiKey).
da: Generering af den offentlige nøgle producerer en selvsignatur, så den samme autentificering, du bruger til at signere med denne nøgle, vil være påkrævet (Face ID, adgangskode eller YubiKey-tap/PIN).
de: Das Erzeugen des öffentlichen Schlüssels erzeugt eine Selbstsignatur, daher wird dieselbe Authentifizierung benötigt, die Sie zum Signieren mit diesem Schlüssel verwenden (Face ID, Code oder YubiKey-Tap/PIN).
es: Generar la clave pública produce una autofirma, por lo que se requerirá la misma autenticación que utiliza para firmar con esta clave (Face ID, código de acceso, o toque/PIN de YubiKey).
fi: Julkisen avaimen luominen tuottaa itse-allekirjoituksen, joten tarvitaan sama todennus, jota käytät allekirjoittamiseen tällä avaimella (Face ID, salakoodi tai YubiKey-kosketus/PIN).
fr: La génération de la clé publique produit une auto-signature, donc la même authentification que celle utilisée pour signer avec cette clé sera requise (Face ID, code d'accès ou YubiKey tap/PIN).
he: יצירת המפתח הציבורי מפיקה חתימה עצמית, ולכן יידרש אותו אימות שאתה משתמש בו לחתימה עם מפתח זה (Face ID, קוד גישה, או הקשה/PIN של YubiKey).
hu: A nyilvános kulcs generálása önaláírást hoz létre, ezért ugyanaz a hitelesítés szükséges, amelyet az ezzel a kulccsal történő aláíráshoz használ (Face ID, jelkód vagy YubiKey érintés/PIN).
it: La generazione della chiave pubblica produce un'autofirma, quindi sarà richiesta la stessa autenticazione che usi per firmare con questa chiave (Face ID, passcode o tocco/PIN della YubiKey).
ja: 公開鍵の生成では自己署名が作成されるため、このキーで署名する際と同じ認証(Face ID、パスコード、またはYubiKeyのタップ/PIN)が必要です。
ko: 공개 키 생성은 자체 서명을 만들기 때문에 이 키로 서명할 때와 동일한 인증(Face ID, 암호 또는 YubiKey 탭/PIN)이 필요합니다.
nb: Generering av den offentlige nøkkelen produserer en selvsignatur, så samme autentisering som du bruker for å signere med denne nøkkelen kreves (Face ID, passkode eller YubiKey-trykk/PIN).
nl: Het genereren van de publieke sleutel produceert een zelf-ondertekening, dus dezelfde authenticatie die u gebruikt om met deze sleutel te ondertekenen is vereist (Face ID, toegangscode of YubiKey-tik/PIN).
pl: Wygenerowanie klucza publicznego tworzy autopodpis, więc wymagane będzie to samo uwierzytelnianie, którego używasz do podpisywania tym kluczem (Face ID, kod dostępu lub dotknięcie/PIN YubiKey).
pt_br: Gerar a chave pública produz uma autoassinatura, então a mesma autenticação que você usa para assinar com esta chave será necessária (Face ID, código ou toque/PIN do YubiKey).
pt_pt: Gerar a chave pública produz uma auto-assinatura, pelo que será necessária a mesma autenticação que utiliza para assinar com esta chave (Face ID, código ou toque/PIN do YubiKey).
ro: Generarea cheii publice produce o auto-semnătură, deci va fi necesară aceeași autentificare pe care o folosești pentru a semna cu această cheie (Face ID, cod de acces sau atingere/PIN YubiKey).
sl: Ustvarjanje javnega ključa ustvari samopodpis, zato bo zahtevana ista overitev, kot jo uporabljate za podpisovanje s tem ključem (Face ID, geslo ali dotik/PIN YubiKey).
sv: Att generera den publika nyckeln skapar en självsignatur, så samma autentisering som du använder för att signera med denna nyckel krävs (Face ID, lösenkod eller YubiKey-tryck/PIN).
uk: Створення відкритого ключа породжує самопідпис, тож знадобиться та сама автентифікація, яку ви використовуєте для підписування цим ключем (Face ID, код-пароль або дотик/PIN YubiKey).
vi: Việc tạo khóa công khai sẽ tạo ra một chữ ký tự ký, vì vậy sẽ yêu cầu cùng phương thức xác thực mà bạn dùng để ký bằng khóa này (Face ID, mật mã, hoặc chạm/PIN YubiKey).
zh_hans: 生成公钥会产生一个自签名，因此需要与使用此密钥签名时相同的认证（Face ID、密码或 YubiKey 触碰/PIN）。
zh_hant: 產生公鑰會建立一個自我簽章，因此需要與使用此金鑰簽署時相同的驗證（Face ID、密碼或 YubiKey 觸碰/PIN）。
